
"Passcode Lock" = "Zamykanie prístupovým kódom";

"All data in this app will be erased after %d failed passcode attempts." = "Po %d neúspešných zadaniach prístupového kódu budú vymazané všetky údaje aplikácie!";
"Cancel" = "Zrušiť";
"Enable" = "Povoliť";
"Erase all content in the app after %d failed passcode attempts." = "Vymazať všetky údaje aplikácie po %d neúspešných pokusoch o zadanie prístupového kódu.";

"Turn Passcode Off" = "Vypnúť prístupový kód";
"Turn Passcode On" = "Zapnúť prístupový kód";
"Change Passcode" = "Zmeniť prístupový kód";
"Erase Data" = "Vymazať údaje";
"Set Passcode" = "Nastaviť prístupový kód";
"Turn off Passcode" = "Vypnúť prístupový kód";
"Enter Passcode" = "Zadajte prístupový kód";
"1 Failed Passcode Attempt" = "1 neúspešné zadanie prístupového kódu";
"%i Failed Passcode Attempts" = "%i neúspešné zadania prístupového kódu";
"Passcodes did not match. Try again." = "Prístupový kód sa nezhoduje";
"Enter a different passcode. You cannot re-use the same passcode." = "Zadajte iný prístupový kód. Nemôžete použiť rovnaký prístupový kód.";
"Erase all data and reset passcode" = "Zmazať všetky údaje a zresetovať prístupový kód";

"Enter your passcode" = "Zadajte svoj prístupový kód";
"Enter a passcode" = "Zadajte 6-miestny prístupový kód";
"Re-enter your passcode" = "Znovu zadajte svoj prístupový kód";
"Enter your old passcode" = "Zadajte svoj starý prístupový kód";
"Enter your new passcode" = "Zadajte svoj nový 6-miestny prístupový kód";
"Re-enter your new passcode" = "Znovu zadajte svoj nový prístupový kód";

"Passcode lock notice" = "Berte na vedomie";
"ResetInfo" = "Neexistuje spôsob, ako zresetovať prístupový kód; ak ho niekedy zabudnete, nebudete mať prístup k vašim konverzáciam.";
"The app passcode lock protects your data against prying eyes, but it is not a replacement for setting a passcode lock on your device.\nIf you haven't done so already, set a device passcode lock too in order to ensure that the data on your device is encrypted." = "Uzamykanie aplikácie prístupovým kódom chrání vaše údaje pred zrakmi nepovolaných osôb, nie je to však náhrada za uzamykanie kódom celého zariadenia.\nAk ste doteraz tak neurobili, nastavte aj zámok zariadenia s prístupovým kódom, aby ste zabezpečili, že údaje v zariadení budú zašifrované.";

"Require Passcode" = "Vyžadovať prístupový kód";
"Immediately" = "Okamžite";
"After 1 minute" = "Po 1 minúte";
"After %d minutes" = "Po %d minútach";
"After 1 min." = "Po 1 min.";
"After %d min." = "Po %d min.";
"After 1 hour" = "Po 1 hodine";
"After %d hours" = "Po %d hodinách";

"Passcode_remove_title" = "Súkromné konverzácie";
"Passcode_remove_message" = "Ak odstránite ochranu prístupu, všetky vaše súkromné konverzácie budú opäť viditeľné v prehľade konverzácií.";
"Passcode_remove_disable" = "Zakázať prístupový kód";
